[
  {
    "id": "01",
    "time": "1819",
    "country": "Germany",
    "name": "velocipede",
    "description": "German Baron Karl von Drais, a civil servant his Laufmaschine (German for 'running machine') in 1817, that was called Draisine(English) orbdraisienne (French) by the press."
  },

  {
    "id": "02",
    "time": "1860s",
    "country": "France",
    "name": "boneshaker",
    "description": "The first really popular and commercially successful design was French. It used rotary cranks and pedals mounted to the front wheel hub. It was difficult to pedal the wheel that was used for steering.  "
  },

  {
    "id": "03",
    "time": "1870s",
    "country": "France",
    "name": "penny-farthing",
    "description": "Known as a high wheel, high wheeler and ordinary, was the first machine to be called a 'bicycle'.It was popular in the 1870s and 1880s, with its large front wheel providing high speeds  and comfort."
  },

  {
    "id": "04",
    "time": "1980s",
    "country": "England",
    "name": "safety bicycle",
    "description": "The first bicycle to be called a 'safety' was designed by the English engineer Harry John Lawson. Unlike with penny-farthings, the rider's feet were within reach of the ground, making it easier to stop."
  },

  {
    "id": "05",
    "time": "1989",
    "country": "England",
    "name": "tandem bike",
    "description": "Patents related to tandem bicycles date from the late 1890s. Around 1898, Mikael Pedersen developed a two-rider tandem version of his Pedersen bicycle."
  },

  {
    "id": "06",
    "time": "1890s",
    "country": "USA",
    "name": "electric bicycle",
    "description": "In the 1890s, electric bicycles were documented within various U.S. patents. For example, on 31 December 1895, Ogden Bolton Jr. was granted U.S. Patent 552,271for a battery-powered bicycle."
  },

  {
    "id": "07",
    "time": "1920s",
    "country": "USA",
    "name": "children bike",
    "description": "Over the 1920s, bicycles gradually became considered children's toys, and by 1940 most bicycles in the United States were made for children. "
  },

  {
    "id": "08",
    "time": "1970",
    "country": "USA",
    "name": "BMX",
    "description": "BMX began during the early 1970s in the United States when children began racing their bicycles on dirt tracks in southern California, inspired by the motocross stars of the time. BMX racing was a phenomenon by the mid-1970s."
  },

  {
    "id": "09",
    "time": "1970",
    "country": "USA",
    "name": "mountain bike",
    "description": "Mountain bikes were modified heavy cruiser bicycles used for freewheeling down mountain trails. The sport became popular in the 1970s in USA, with riders using older, single-speed balloon tire bicycles to ride down rugged hillsides."
  },

  {
    "id": "10",
    "time": "Today",
    "country": "worldwide",
    "name": "modern bikes",
    "description": "Bicycle frames and components continue to get lighter and more aerodynamic without sacrificing strength largely through the use of computer aided design, finite element analysis, and computational fluid dynamics."
  }
]
